import React from 'react'
import { render } from 'react-dom'
import App from './App.js'

const params = {
  'name': 'Kirana Amat',
  'insuranceNo': '123123123123',

  header:{
    header1: 'แบบสอบถามเกี่ยวกับโรคความดันโลหิตสูง',
    header2: 'Kirana Amat',
    header3: 123123123123
  },
  body: {
    'knowDate': '10/12/2560',
    'cureDate': '12/12/2560',
    'doctorName': 'abc',
  },
  footer:{
    footer1:'ข้าพเจ้าขอรับรองว่า ตั้งแต่วันยื่นใบคำขอเอาประกันภัยดังกล่าวถึงปัจจุบันสุขภาพของข้าพเจ้าไม่มีการเปลี่ยนแปลง และข้าพเจ้าไม่',
    footer2:'ได้รับการรักษาโรค การปรึกษาหรือการตรวจโรคแต่อย่างใดเลยและขอรับรองต่อไปอีกว่าคำตอบทั้งหมดของข้าพเจ้าที่ได้ให้ไว้ในใบ',
    footer3:'คำขอดังกล่าว รวมทั้งเรื่องราวที่เกี่ยวกับการประกอบอาชีพของข้าพเจ้ายังคงเป็นความจริงตามเดิมทุกประการ',
    footer4:'ลงชื่อ ณ........................................................................................',
    footer5:'.........................................................................................',
    footer6:'(                     )',
    footer7:'พยาน/ตัวแทน/นายหน้า',
    footer8:'.........................................................................................',
    footer9:'(                     )',
    footer10:'พยาน',
    footer11:'เมื่อวันที่..................เดือน....................................พ.ศ...................',
    footer12:'.........................................................................................',
    footer13:'(                             )',
    footer14:'ลายมือชื่อผู้ประกันภัย',
    footer15:'(กรณีที่เป็นใบคำขอเอาประกันภัยเยาวชนให้ผู้ชำระเบี้ยเป็นผู้ลงนาม',
    footer16:'และถ้าผู้ขอเอาประกันภัยยังไม่บรรลุนิติภาวะ ให้บิดา,มารดา',
    footer17:'หรือผู้ปกครองลงนามเป็นพยานด้วย',
  },
}


const rootEl = document.getElementById('app')

if (module.hot) {
    module.hot.accept('./App', () => {
        const NextApp = require('./App').default
        render(<NextApp {...params}/>, rootEl)
    })
}

render(<App {...params}/>,  rootEl)
